{
  "data": [
    {
      "id": "1",
      "category": "caramel ",
      "title": "Burnt Sugar Caramel Cake",
      "by": "Posted on September 9, 2019 ",
      "imageLocation": "burnt-sugar-cake",
      "content": "This burnt sugar caramel cake is a wonderfully sweet and buttery cake flavored with homemade burnt sugar syrup. The syrup combines caramelized sugar and water, a mixture you cook on the stove until it’s dark amber in color. The cake does not taste burnt, bitter, or charred. Rather, it tastes like caramel and caramelized sugar, the same topping used for creme brûlée! We’ll flavor the frosting with burnt sugar syrup as well. Inside the cake and frosting, the syrup tastes like caramel. In my experience, this is the only from-scratch caramel flavored addition that (1) provides flavor and (2) doesn’t ruin the cake’s texture."
    },
    {
      "id": "2",
      "category": "pineapple",
      "title": "Pineapple Upside Down Cake",
      "by": "Posted on April 9, 2020",
      "imageLocation": "pineapple-upside-down-cake",
      "content": "I developed and published a pineapple upside down cake recipe several years ago. It’s certainly loved by many, but the cake is prone to overflowing because there’s quite a lot of batter. Additionally, it can taste overly wet and the instructions were never written very clearly. As a cookbook author and baker, I’ve certainly improved my craft over the years! Though I kept the original recipe written in the notes below, I want to share my new and improved version with you.My improved pineapple upside down cake recipe, written below, is much softer than my original. Using creamed butter instead of melted, cake flour instead of all-purpose flour, all white sugar instead of brown sugar + white, and using egg whites guarantees a huge textural difference. I adapted it from my white cake. Additionally, we’ll skip the pineapple juice in the cake batter because it often produces a wet crumb. (There’s plenty of pineapple flavor in the topping!) Finally, my new recipe doesn’t yield as much cake batter, so we don’t have to worry about overflowing."
    },
    {
      "id": "3",
      "category": "pavlova",
      "title": "Pavlova",
      "by": "Posted on March 21, 2018 ",
      "imageLocation": "pavlova",
      "content": "What is pavlova? Pavlova is a dessert popular in New Zealand and Australia. It’s not as common here in the states, but I hope to help change that! A texture freak’s dream come true, pavlova is made from egg whites that are slowly baked in a relatively cool oven. The egg whites take on a chewy-crisp texture on top, a soft marshmallow texture inside, and a crunchy crisp texture around the edges. That’s three completely different textures in one single bite. The crunchy edges are just like meringue cookies."
    },
    {
      "id": "4",
      "category": "chocolate",
      "title": "Chocolate Peanut Butter",
      "by": "Posted on October 25, 2019",
      "imageLocation": "chocolate-peanut-butter",
      "content": "Have I mentioned yet how easy these cookies are? Besides using super basic ingredients, the method couldn’t be simpler. Whisk the butter, sugar, milk, and cocoa powder together in a medium (3 quart) pot until the butter melts. Once simmering around the edges, start a timer. Let it simmer for 1 minute. After that, immediately remove from heat and stir in the peanut butter and vanilla extract. Once combined, stir in the oats.Grab your timer again and let the mixture cool for 4-5 minutes. This gives the oats some time to absorb the liquid, which makes scooping and shaping much easier. If you used a super thin natural-style peanut butter, let it sit for about 10 minutes."
    },
    {
      "id": "5",
      "category": "caramel",
      "title": "Caramel Pear Pie",
      "by": "Posted on November 3, 2017",
      "imageLocation": "caramel-pear-pie",
      "content": "I like to use Anjou (red or green), Bartletts (red or green), or Bosc pears in pie. To avoid a mushy filling, look for pears that are slightly firm. Your best bet is to purchase about 6-7 pears, then let them sit in a paper bag for 1-2 days to slightly ripen. Much longer than this and they’ll be too soft. You’ll only need about 5 pears for the pie, but I suggest picking up an extra in case any develop soft spots.Peel the pears, then cut them into (about) 1/2-inch chunks. You’ll mix the pears with sugar + cinnamon, and flour to thicken. A pinch of ground ginger adds that little something special, while a waterfall of caramel adds a BIG SOMETHING SPECIAL."
    },
    {
      "id": "6",
      "category": "pineapple",
      "title": "Pineapple Carrot Cake",
      "by": "Posted on March 20, 2017",
      "imageLocation": "pineapple-carrot-cake",
      "content": "I like to use Anjou (red or green), Bartletts (red or green), or Bosc pears in pie. To avoid a mushy filling, look for pears that are slightly firm. Your best bet is to purchase about 6-7 pears, then let them sit in a paper bag for 1-2 days to slightly ripen. Much longer than this and they’ll be too soft. You’ll only need about 5 pears for the pie, but I suggest picking up an extra in case any develop soft spots.Peel the pears, then cut them into (about) 1/2-inch chunks. You’ll mix the pears with sugar + cinnamon, and flour to thicken. A pinch of ground ginger adds that little something special, while a waterfall of caramel adds a BIG SOMETHING SPECIAL."
    },
    {
      "id": "7",
      "category": "garlic",
      "title": "Homemade Garlic Knots",
      "by": "Posted on February 25, 2020 ",
      "imageLocation": "garlic-knots",
      "content": "These homemade garlic knots are extra soft and fluffy, made from my favorite 6 ingredient pizza dough, and are topped with flavorful garlic herb butter before AND after baking. Shaping is a breeze with my video tutorial and step-by-step pictures for visual help. This recipe is brought to you in partnership with Red Star Yeast.I’ve made these garlic knots 3x in the past month. Each batch yields 16 and there’s only 2 adults in this house. You do the math. (Ok ok, one night we had friends over for dinner but still.) These are the BEST garlic knots!!! I’m knot even kidding. 😉"
    },
    {
      "id": "8",
      "category": "apple",
      "title": "Greek Yogurt Apple Blueberry Bread",
      "by": "Posted on April 11, 2018",
      "imageLocation": "apple-blueberry",
      "content": "Wholesome Greek yogurt apple blueberry bread is made with honey, apples, blueberries, and Greek yogurt. This quick bread is a healthy snack or breakfast– with zero refined sugar! I love simple and quick recipes that can easily double as breakfast or snack, like blueberry muffin bread, blueberry almond power muffins, and banana muffins. Today’s Greek yogurt apple blueberry bread is no exception. You’ll appreciate the list of wholesome ingredients– Greek yogurt, honey, apple, blueberries, warm spices, and not much else. It’s made without refined sugar, similar to my Greek yogurt zucchini bread with a fun and flavorful fruity twist."
    },
    {
      "id": "9",
      "category": "chocolate",
      "title": "Croissants (Pain au Chocolate)",
      "by": "Posted on April 16, 2018 ",
      "imageLocation": "chocolate-croissants",
      "content": "In case you’re just joining us, croissants are the April Baking Challenge recipe. I published a complete guide to tackling croissants and challenged you to bake them this month. I challenge readers to a new recipe every month on or around the 1st, all filed under the category Sally’s Baking Challenge!Here we are 2 weeks later with a croissant variation. Am I allowed to admit that these are even better than the original? Ultra thin layers. Buttery crispness. Melted chocolate. Confectioners’ sugar dusting. Simple. Decadent. There’s absolutely nothing on earth better than a warm chocolate croissant unless that warm chocolate croissant was proudly handmade in your own kitchen."
    },
    {
      "id": "10",
      "category": "apple",
      "title": "Homemade Bread Bowls",
      "by": "Posted on January 1, 2018  ",
      "imageLocation": "bread-bowls",
      "content": "Tie on your aprons, gather your determination, and heat up that creamy soup. Let’s dive right into homemade bread bowls! Today I’m going to talk about the dough itself, convince you there’s nothing to fear, share the recipe, then walk you through step-by-step pictures so you can see how the bread bowls come together."
    },
    {
      "id": "11",
      "category": "apple",
      "title": "Moist Apple Bread",
      "by": "Posted on October 17, 2018",
      "imageLocation": "moist-apple-bread",
      "content": "This is my favorite apple bread recipe, one that I’ve cherished for years. It’s the recipe that comes to mind first when I have leftover spotty apple on the counter and the bread that’s on constant rotation in my freezer stash. This is the best ever apple bread recipe and if you haven’t tried it yet, now’s the time."
    }
  ]
}
