{
  "data": [
    {
      "id": "1",
      "category": "Bread",
      "title": "Homemade Garlic Knots",
      "by": "Posted on February 25, 2020 ",
      "imageLocation": "garlic-knots",
      "content": "These homemade garlic knots are extra soft and fluffy, made from my favorite 6 ingredient pizza dough, and are topped with flavorful garlic herb butter before AND after baking. Shaping is a breeze with my video tutorial and step-by-step pictures for visual help. This recipe is brought to you in partnership with Red Star Yeast.I’ve made these garlic knots 3x in the past month. Each batch yields 16 and there’s only 2 adults in this house. You do the math. (Ok ok, one night we had friends over for dinner but still.) These are the BEST garlic knots!!! I’m knot even kidding. 😉"
    },
    {
      "id": "2",
      "category": "Bread",
      "title": "Greek Yogurt Apple Blueberry Bread",
      "by": "Posted on April 11, 2018",
      "imageLocation": "apple-blueberry",
      "content": "Wholesome Greek yogurt apple blueberry bread is made with honey, apples, blueberries, and Greek yogurt. This quick bread is a healthy snack or breakfast– with zero refined sugar! I love simple and quick recipes that can easily double as breakfast or snack, like blueberry muffin bread, blueberry almond power muffins, and banana muffins. Today’s Greek yogurt apple blueberry bread is no exception. You’ll appreciate the list of wholesome ingredients– Greek yogurt, honey, apple, blueberries, warm spices, and not much else. It’s made without refined sugar, similar to my Greek yogurt zucchini bread with a fun and flavorful fruity twist."
    },
    {
      "id": "3",
      "category": "Bread",
      "title": "Croissants (Pain au Chocolate)",
      "by": "Posted on April 16, 2018 ",
      "imageLocation": "chocolate-croissants",
      "content": "In case you’re just joining us, croissants are the April Baking Challenge recipe. I published a complete guide to tackling croissants and challenged you to bake them this month. I challenge readers to a new recipe every month on or around the 1st, all filed under the category Sally’s Baking Challenge!Here we are 2 weeks later with a croissant variation. Am I allowed to admit that these are even better than the original? Ultra thin layers. Buttery crispness. Melted chocolate. Confectioners’ sugar dusting. Simple. Decadent. There’s absolutely nothing on earth better than a warm chocolate croissant unless that warm chocolate croissant was proudly handmade in your own kitchen."
    }
  ]
}
